In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
animal = DataFrame(np.arange(16).reshape(4,4),
                    columns = ['X','Y','Z','W'],
                    index=['cat','dog','bird','snake'])

In [3]:
animal

        X   Y   Z   W
cat     0   1   2   3
dog     4   5   6   7
bird    8   9  10  11
snake  12  13  14  15

In [4]:
animal.loc[1:2,['X','Z']] = np.nan

In [5]:
animal

          X   Y     Z   W
cat     0.0   1   2.0   3
dog     NaN   5   NaN   7
bird    8.0   9  10.0  11
snake  12.0  13  14.0  15

In [8]:
behavior = {'X':'good' , 'Y':'bad', 'Z':'good', 'W':'bad'}
behavior

{'X': 'good', 'Y': 'bad', 'Z': 'good', 'W': 'bad'}

In [11]:
animal_behav = animal.groupby(behavior, axis=1)
animal_behav.sum()

        bad  good
cat     4.0   2.0
dog    12.0   0.0
bird   20.0  18.0
snake  28.0  26.0

In [12]:
behave_series = Series(behavior)
behave_series

X    good
Y     bad
Z    good
W     bad
dtype: object

In [14]:
animal.groupby(behave_series, axis=1).count()

       bad  good
cat      2     2
dog      2     0
bird     2     2
snake    2     2

In [15]:
animal

          X   Y     Z   W
cat     0.0   1   2.0   3
dog     NaN   5   NaN   7
bird    8.0   9  10.0  11
snake  12.0  13  14.0  15

In [16]:
animal.groupby(len).sum()   #group by the length of the index character

      X   Y     Z   W
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [17]:
key = ['A','B','A','B']

In [18]:
animal.groupby([len, key]).max()

        X   Y     Z   W
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [21]:
heir_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]], names=['city','value'])

In [24]:
dframe = DataFrame(np.arange(25).reshape(5,5), columns=heir_col)

In [27]:
dframe = dframe*100
dframe

city       NY                      SF
value       1       2       3       1       2
0           0   10000   20000   30000   40000
1       50000   60000   70000   80000   90000
2      100000  110000  120000  130000  140000
3      150000  160000  170000  180000  190000
4      200000  210000  220000  230000  240000